
Процедура Печать(ТабДок, Ссылка) Экспорт
	//{{_КОНСТРУКТОР_ПЕЧАТИ(Печать)
	Макет = Документы.РегистрацияЦен.ПолучитьМакет("Печать");
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	РегистрацияЦен.Дата,
	|	РегистрацияЦен.Номер,
	|	РегистрацияЦен.Организация,
	|	РегистрацияЦен.ТоварыИУслуги.(
	|		НомерСтроки,
	|		Номенклатура,
	|		Цена
	|	)
	|ИЗ
	|	Документ.РегистрацияЦен КАК РегистрацияЦен
	|ГДЕ
	|	РегистрацияЦен.Ссылка В (&Ссылка)";
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();

	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	Шапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьТоварыИУслугиШапка = Макет.ПолучитьОбласть("ТоварыИУслугиШапка");
	ОбластьТоварыИУслуги = Макет.ПолучитьОбласть("ТоварыИУслуги");
	Подвал = Макет.ПолучитьОбласть("Подвал");

	ТабДок.Очистить();

	ВставлятьРазделительСтраниц = Ложь;
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;

		ТабДок.Вывести(ОбластьЗаголовок);

		Шапка.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Шапка, Выборка.Уровень());

		ТабДок.Вывести(ОбластьТоварыИУслугиШапка);
		ВыборкаТоварыИУслуги = Выборка.ТоварыИУслуги.Выбрать();
		Пока ВыборкаТоварыИУслуги.Следующий() Цикл
			ОбластьТоварыИУслуги.Параметры.Заполнить(ВыборкаТоварыИУслуги);
			ТабДок.Вывести(ОбластьТоварыИУслуги, ВыборкаТоварыИУслуги.Уровень());
		КонецЦикла;

		Подвал.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Подвал);

		ВставлятьРазделительСтраниц = Истина;
	КонецЦикла;
	//}}
КонецПроцедуры
