
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)

	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаказТоваров") Тогда
		// Заполнение шапки
		Договор = ДанныеЗаполнения.Договор;
		Контрагент = ДанныеЗаполнения.Контрагент;
		Организация = ДанныеЗаполнения.Организация;
		СуммаИтого = ДанныеЗаполнения.СуммаИтого;
		Для Каждого ТекСтрокаТабНоменклатура Из ДанныеЗаполнения.ТабНоменклатура Цикл
			НоваяСтрока = ТабНоменклатура.Добавить();
			НоваяСтрока.Количество = ТекСтрокаТабНоменклатура.Количество;
			НоваяСтрока.Номенклатура = ТекСтрокаТабНоменклатура.Номенклатура;
			НоваяСтрока.Сумма = ТекСтрокаТабНоменклатура.Сумма;
			НоваяСтрока.Цена = ТекСтрокаТабНоменклатура.Цена;
		КонецЦикла;
	КонецЕсли;  
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	РаботаСТабличнымиЧастями.СвернутьТовары(ТабНоменклатура);
	
	СуммаИтого = ТабНоменклатура.Итог("Сумма");
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр Взаиморасчеты Расход
	Движения.Взаиморасчеты.Записывать = Истина;
	Для Каждого ТекСтрокаТабНоменклатура Из ТабНоменклатура Цикл
		Движение = Движения.Взаиморасчеты.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Организация = Организация;
		Движение.Контрагент = Контрагент;
		Движение.Договор = Договор;
		Движение.Сумма = ТекСтрокаТабНоменклатура.Сумма;
	КонецЦикла;

	// регистр ОстаткиНоменклатуры Приход
	Движения.ОстаткиНоменклатуры.Записывать = Истина;
	Для Каждого ТекСтрокаТабНоменклатура Из ТабНоменклатура Цикл
		Движение = Движения.ОстаткиНоменклатуры.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Организация = Организация;
		Движение.Склад = Склад;
		Движение.Номенклатура = ТекСтрокаТабНоменклатура.Номенклатура;
		Движение.Количество = ТекСтрокаТабНоменклатура.Количество;
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
