&НаСервере
Функция РассчитатьНДС(СуммаБезНДС, СтавкаНДС) Экспорт
	// СтавкаНДС - ссылка на справочник
	// Возвращает сумму НДС
	
	Если СтавкаНДС.НеОблагается Тогда
		возврат 0
	КонецЕсли;       
	
	Если СтавкаНДС.Расчетная Тогда
		// Расчетная ставка: НДС = Сумма * (Ставка / (100 + Ставка))
		Возврат СуммаБезНДС * (СтавкаНДС.Ставка / (100 + СтавкаНДС.Ставка));
	Иначе
		// Обвчная ставка: НДС = Сумма * (Ставка / 100)
		Возврат СуммаБезНДС * (СтавкаНДС.Ставка / 100.0);
	КонецЕсли;
КонецФункции

&НаСервере
Функция ЦенаСНДС(ЦенаБезНДС, СтавкаНДС) Экспорт 
	// Возвращает цену с НДС
	Возврат ЦенаБезНДС + РассчитатьНДС(ЦенаБезНДС, СтавкаНДС);
КонецФункции

&НаСервере
Функция ПолучитьСтавкуНДС(Номенклатура) Экспорт
    // Возвращает ставку из карточки товара
	Если ЗначениеЗаполнено(Номенклатура.СтавкаНДС) Тогда
		Возврат Номенклатура.СтавкаНДС;
	Иначе
		// Ставка по умолчанию (22%)
		Возврат Справочники.СтавкиНДС.НайтиПоНаименованию("22%", Истина);
	КонецЕсли;
КонецФункции                

&НаСервере
Функция СтавкаНеОблагается(СтавкаНДС) Экспорт
    Если ЗначениеЗаполнено(СтавкаНДС) Тогда
        Возврат СтавкаНДС.НеОблагается;
    Иначе
        Возврат Истина;
    КонецЕсли;
КонецФункции