Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	РаботаСТабличнымиЧастями.СвернутьТовары(ТабНоменклатура);
	
	СуммаИтого = ТабНоменклатура.Итог("Сумма");
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.СчетНаОплату") Тогда
		// Заполнение шапки
		Договор = ДанныеЗаполнения.Договор;
		Контрагент = ДанныеЗаполнения.Контрагент;
		Организация = ДанныеЗаполнения.Организация;
		СуммаИтого = ДанныеЗаполнения.СуммаИтого;
		Для Каждого ТекСтрокаТабНоменклатура Из ДанныеЗаполнения.ТабНоменклатура Цикл
			Если ТекСтрокаТабНоменклатура.Номенклатура.ВидНоменклатуры =
			Перечисления.ВидыНоменклатуры.Товар Тогда
				НоваяСтрока = ТабНоменклатура.Добавить();
				НоваяСтрока.ЕдиницаИзмерения = ТекСтрокаТабНоменклатура.ЕдиницаИзмерения;
				НоваяСтрока.Количество = ТекСтрокаТабНоменклатура.Количество;
				НоваяСтрока.Номенклатура = ТекСтрокаТабНоменклатура.Номенклатура;
				НоваяСтрока.ВидНоменклатуры = ТекСтрокаТабНоменклатура.ВидНоменклатуры;
				НоваяСтрока.Сумма = ТекСтрокаТабНоменклатура.Сумма;
				НоваяСтрока.Цена = ТекСтрокаТабНоменклатура.Цена; 
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	
	Движения.Продажи.Записывать = Истина;
	Движения.Взаиморасчеты.Записывать = Истина;
	Движения.ОстаткиНоменклатуры.Записывать = Истина;
	
	Для Каждого ТекСтрокаТабНоменклатура Из ТабНоменклатура Цикл
		Движение = Движения.Продажи.Добавить();
		Движение.Период = Дата;
		Движение.Организация = Организация;
		Движение.Номенклатура = ТекСтрокаТабНоменклатура.Номенклатура;
		Движение.Мастер = Мастер;
		Движение.Клиент = Контрагент;
		Движение.Количество = ТекСтрокаТабНоменклатура.Количество;
		Движение.Выручка = ТекСтрокаТабНоменклатура.Сумма; 
		
		Движение = Движения.Взаиморасчеты.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Организация = Организация;
		Движение.Контрагент = Контрагент;
		Движение.Договор = Договор;
		Движение.Сумма = ТекСтрокаТабНоменклатура.Сумма;
		
		Движение = Движения.ОстаткиНоменклатуры.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Организация = Организация;
		Движение.Склад = Склад;
		Движение.Номенклатура = ТекСтрокаТабНоменклатура.Номенклатура;
		Движение.Количество = ТекСтрокаТабНоменклатура.Количество;

	КонецЦикла;
	
	Движения.ОстаткиНоменклатуры.Записать(); 
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОстаткиНоменклатурыОстатки.Организация КАК Организация,
		|	ОстаткиНоменклатурыОстатки.Склад КАК Склад,
		|	ОстаткиНоменклатурыОстатки.Номенклатура КАК Номенклатура,
		|	ОстаткиНоменклатурыОстатки.КоличествоОстаток КАК Количество
		|ИЗ
		|	РегистрНакопления.ОстаткиНоменклатуры.Остатки(
		|			,
		|			Склад = &Склад
		|				И Организация = &Организация
		|				И Номенклатура В
		|					(ВЫБРАТЬ
		|						РеализацияТоваровТабНоменклатура.Номенклатура КАК Номенклатура
		|					ИЗ
		|						Документ.РеализацияТоваров.ТабНоменклатура КАК РеализацияТоваровТабНоменклатура
		|					ГДЕ
		|						РеализацияТоваровТабНоменклатура.Ссылка = &Ссылка)) КАК ОстаткиНоменклатурыОстатки
		|ГДЕ
		|	ОстаткиНоменклатурыОстатки.КоличествоОстаток < 0";
	
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Склад", Склад);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если НЕ РезультатЗапроса.Пустой() Тогда   
		// Товара недостаточно
		Отказ = Истина;
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать(); 
	
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			Сообщить("Недостаточно товара " + ВыборкаДетальныеЗаписи.Номенклатура + " в количестве " + (-ВыборкаДетальныеЗаписи.Количество));
		КонецЦикла; 
	КонецЕсли;

КонецПроцедуры


