&НаСервере
Функция ПолучитьОстаткиПоВсемТоварам(Склад, ТаблицаТоваров, Дата)
	// Собрать список номенклатуры
	СписокНоменклатуры = Новый СписокЗначений;

	Для Каждого Строка Из ТаблицаТоваров Цикл
	    Если СписокНоменклатуры.НайтиПоЗначению(Строка.Номенклатура) = Неопределено Тогда
	        СписокНоменклатуры.Добавить(Строка.Номенклатура);
	    КонецЕсли;
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ОстаткиНоменклатурыОстатки.Номенклатура КАК Номенклатура,
		|	ОстаткиНоменклатурыОстатки.КоличествоОстаток КАК КоличествоОстаток
		|ИЗ
		|	РегистрНакопления.ОстаткиНоменклатуры.Остатки(
		|			&Дата,
		|			Склад = &Склад
		|				И Номенклатура В (&СписокНоменклатуры)) КАК ОстаткиНоменклатурыОстатки";
		
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("Склад", Склад);
	Запрос.УстановитьПараметр("СписокНоменклатуры", СписокНоменклатуры);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

Процедура ОбработкаПроведения(Отказ, Режим)
	// Проверка на разные склады
	Если СкладОтправитель = СкладПолучатель Тогда
		Отказ = Истина;
		Сообщить("Склады-отправитель и склад-получатель не должны совпадать");
		Возврат
	КонецЕсли; 
	
	// Получить остатки
	ТаблицаОстатков = ПолучитьОстаткиПоВсемТоварам(СкладОтправитель, ТабНоменклатура, Дата);
	
	// Проверка остатка склада-отправителя
	Для Каждого ТекСтрока из ТабНоменклатура Цикл
		СтрокаОстатка = ТаблицаОстатков.Найти(ТекСтрока.Номенклатура, "Номенклатура");
    	Остаток = ?(СтрокаОстатка = Неопределено, 0, СтрокаОстатка.КоличествоОстаток);
		
		Если Остаток < ТекСтрока.Количество Тогда
	        Отказ = Истина;
	        Сообщить("Не хватает " + ТекСтрока.Номенклатура + " на складе " + СкладОтправитель 
	            + " в количестве " + (ТекСтрока.Количество - Остаток));
			Возврат
		КонецЕсли;
	КонецЦикла;
	
	
	// регистр ОстаткиНоменклатуры Приход и расход
	Движения.ОстаткиНоменклатуры.Записывать = Истина;

	Для Каждого ТекСтрока Из ТабНоменклатура Цикл
        // Расход со склада-отправителя
        ДвижениеРасход = Движения.ОстаткиНоменклатуры.Добавить();
        ДвижениеРасход.ВидДвижения = ВидДвиженияНакопления.Расход;
        ДвижениеРасход.Период = Дата;
        ДвижениеРасход.Организация = Организация;
        ДвижениеРасход.Склад = СкладОтправитель;
        ДвижениеРасход.Номенклатура = ТекСтрока.Номенклатура;
        ДвижениеРасход.Количество = ТекСтрока.Количество;
        
        // Приход на склад-получатель
        ДвижениеПриход = Движения.ОстаткиНоменклатуры.Добавить();
        ДвижениеПриход.ВидДвижения = ВидДвиженияНакопления.Приход;
        ДвижениеПриход.Период = Дата;
        ДвижениеПриход.Организация = Организация;
        ДвижениеПриход.Склад = СкладПолучатель;
        ДвижениеПриход.Номенклатура = ТекСтрока.Номенклатура; 
        ДвижениеПриход.Количество = ТекСтрока.Количество;
	КонецЦикла;
	
КонецПроцедуры
