
//Процедура РассчитатьСумму(СтрокаТЧ) Экспорт
//    СтрокаТЧ.Сумма = СтрокаТЧ.Количество * СтрокаТЧ.Цена;
//КонецПроцедуры      

Процедура РассчитатьСуммуСНДС(СтрокаТЧ) Экспорт
    // Считаем сумму без НДС
    СтрокаТЧ.Сумма = СтрокаТЧ.Количество * СтрокаТЧ.Цена;
    
    // Считаем НДС через серверную функцию
    Если ЗначениеЗаполнено(СтрокаТЧ.СтавкаНДС) И НЕ РаботаСНДС.СтавкаНеОблагается(СтрокаТЧ.СтавкаНДС) Тогда
        СтрокаТЧ.СуммаНДС = РаботаСНДС.РассчитатьНДС(СтрокаТЧ.Сумма, СтрокаТЧ.СтавкаНДС);
    Иначе
        СтрокаТЧ.СуммаНДС = 0;
    КонецЕсли;
    
    // Прибавляем НДС к сумме
    СтрокаТЧ.Сумма = СтрокаТЧ.Сумма + СтрокаТЧ.СуммаНДС;
КонецПроцедуры

Функция ИтоговоеЧислоПрописью(СуммаИтого) Экспорт
    
    Если СуммаИтого <> 0 Тогда
        
        ФормСтрока = "Л = ru_RU; ДП = Ложь";
        ПарПредмета = "рубль,рубля,рублей,м,копейка,копейки,копеек,ж,2";
        ПрописьЧисла = ЧислоПрописью(СуммаИтого, ФормСтрока, ПарПредмета);
        
        СуммаИтогоПрописью = Формат(СуммаИтого, "ЧДЦ=2") + " руб. / " + ПрописьЧисла + ".";
        
    Иначе
        
        СуммаИтогоПрописью = "<< >>";
        
    КонецЕсли;
    
    Возврат СуммаИтогоПрописью;
    
КонецФункции