Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	РаботаСТабличнымиЧастями.СвернутьТовары(ТабНоменклатура); 
	
	СуммаИтого = ТабНоменклатура.Итог("Сумма");
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
		Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.СчетНаОплату") Тогда
		// Заполнение шапки
		Договор = ДанныеЗаполнения.Договор;
		Контрагент = ДанныеЗаполнения.Контрагент;
		Организация = ДанныеЗаполнения.Организация;
		СуммаИтого = ДанныеЗаполнения.СуммаИтого;
		Для Каждого ТекСтрокаТабНоменклатура Из ДанныеЗаполнения.ТабНоменклатура Цикл
			Если ТекСтрокаТабНоменклатура.Номенклатура.ВидНоменклатуры =
			Перечисления.ВидыНоменклатуры.Услуга Тогда
				НоваяСтрока = ТабНоменклатура.Добавить();
				НоваяСтрока.ЕдиницаИзмерения = ТекСтрокаТабНоменклатура.ЕдиницаИзмерения;
				НоваяСтрока.Количество = ТекСтрокаТабНоменклатура.Количество;
				НоваяСтрока.Номенклатура = ТекСтрокаТабНоменклатура.Номенклатура;
				НоваяСтрока.Сумма = ТекСтрокаТабНоменклатура.Сумма;
				НоваяСтрока.Цена = ТекСтрокаТабНоменклатура.Цена;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	Движения.Взаиморасчеты.Записывать = Истина;
	Движения.Продажи.Записывать = Истина;
	
	Для Каждого ТекСтрокаТабНоменклатура Из ТабНоменклатура Цикл
		
		Движение = Движения.Взаиморасчеты.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Организация = Организация;
		Движение.Контрагент = Контрагент;
		Движение.Договор = Договор;
		Движение.Сумма = ТекСтрокаТабНоменклатура.Сумма; 
		
		Движение = Движения.Продажи.Добавить();
		Движение.Период = Дата;
		Движение.Организация = Организация;
		Движение.Номенклатура = ТекСтрокаТабНоменклатура.Номенклатура;
		Движение.Мастер = Мастер;
		Движение.Клиент = Договор;
		Движение.Количество = ТекСтрокаТабНоменклатура.Количество;
		Движение.Выручка = ТекСтрокаТабНоменклатура.Сумма;  
		
	КонецЦикла;


КонецПроцедуры

